.pragma library

//image_emoticon.png
var emotion_name = [
            "呵呵", "哈哈", "吐舌", "啊", "酷", "怒", "开心", "汗", "泪", "黑线",
            "鄙视", "不高兴", "真棒", "钱", "疑问", "阴险", "吐", "咦", "委屈", "花心",
            "呼~", "笑眼", "冷", "太开心", "滑稽", "勉强", "狂汗", "乖", "睡觉", "惊哭",
            "升起", "惊讶", "喷", "爱心", "心碎", "玫瑰", "礼物", "彩虹", "星星月亮", "太阳",
            "钱币", "灯炮", "茶杯", "蛋糕", "音乐", "haha", "胜利", "大拇指", "弱", "OK"
        ]

//ali_059.png
var ali_file = [
            47, 50, 51, 52, 53, 54, 55, 56, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70
        ]
var ali_name = [
            "哭着跑", "惆怅~", "摸头", "蹭", "打滚", "叩拜", "摸", "数钱", "加1", "压力",
            "表逼我", "人呢", "摇晃", "打地鼠", "这个屌", "恐慌", "晕乎乎", "浮云", "给力", "杯具了"
        ]

//yz_001.png
var yz_file = [
            1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21
        ]
var yz_name = [
            "焦糖舞", "翻滚", "拍屁股做鬼脸", "不", "河蟹掉啦", "哦耶", "我倒", "投降", "听音乐", "被砸",
            "吐舌头", "太好啦", "财源滚滚", "人去哪了", "偷笑", "卷被", "看楼上", "我抽", "有木有", "哭"
        ]

//b01.png
var b_name = [
            "微笑", "帅哥", "美女", "老大", "哈哈哈", "奸笑", "傻乐", "飞吻", "害羞", "花痴",
            "憧憬", "你牛", "鼓掌", "可爱", "太委屈", "大哭", "泪奔", "寻死", "非常惊讶", "表示疑问"
        ]


//she_001.png
var she_name = [
            "蛇年", "红包拿来", "美人鱼", "恭喜发财", "回家过年", "点灯笼", "招财兔", "喜庆鼓", "扭一扭", "又长一岁",
            "年年有鱼", "求红包", "压岁钱", "拜年"
        ]

var emo_text = [
            "(゜o゜(☆○=(-_- )", "(づ￣ ³￣)づ", "(#ﾟДﾟ)", "ヽ(#`Д´)ﾉ", "(¬_¬)ﾉ", "ヽ(｀0´)ﾉ",
            "(○’ω’○)", "(=ﾟωﾟ)ノ", "(〜￣▽￣)〜", "〜(￣△￣〜)", "(×_×;)", "Ψ(｀▽´)Ψ", "(・｀ω´・)",
            "ヽ(´Д｀)人(´Д｀)人(´Д｀)ノ", "☆*:.｡.o(≧▽≦)o.｡.:*☆", "(*￣з￣)", "(Ｔ▽Ｔ)", "(´▽｀)ノ♪",
            "⊙﹏⊙", "(╯#-_-)╯┴—┴", "╧═╧~~\(-皿-\#）（╯#-皿-)╯~~╧═╧", "( ͡° ͜ʖ ͡°)", "_(:3J Z )_"
        ]

var emo_regexp_gif = /^(B|b|t|w)_\d*/
var emo_regexp_png = /^((ali|she|write_face|yz)_|b|image_emoticon)\d*/

function getEmotion(text){
    text = text.replace(/i_f/, "write_face_");
    if (emo_regexp_gif.test(text)){
        return '<img src="'+Qt.resolvedUrl("../emo/"+text.toLowerCase()+".gif")+'"/>';
    } else if (emo_regexp_png.test(text)){
        return '<img src="'+Qt.resolvedUrl("../emo/"+text.toLowerCase()+".png")+'"/>';
    } else {
        return "[%1]".arg(text);
    }
}
